# Задача 1, Вариант 7 
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Эдуард Георгиевич Зюбин. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Быховская А.С
# 31.03.2016
print('Эдуард Георгиевич Зюбин - советский поэт, он же Багрицкий Эдуард') 
input("Нажмите Enter для выхода")
