Мысль вызывает страдания.
# Задача 2, Вариант 7 
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Стендаль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Быховская А.С
# 31.03.2016

print (''' Мысль вызывает страдания.

 \t\t Стендаль.''')
input ('Нажмите Enter для выхода')