# Задача 4, Вариант 7 
# Напишите программу, которая выводит имя, под которым скрывается Мария Луиза Чеччарелли. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Быховская А.с.
# 18.04.2016


print("Мария Луиза Чеччарелли более известена, как  итальянская актриса театра и кино Моника Витти ")

b= 1931
a = 2015 - 1931
p = "Рим, Италия"
i = "Театр, кино, футбол"

print("Место рождения:",p)
print("Год рождения:",b)
print("Возраст:",a)
print("Область интересов:",i)

input("Нажмите Enter для выхода")